path_to_xndx_ma = r'C:\Users\Артем\PycharmProjects\University\master_work\pictures\xndx_ma.png'
path_to_xndx_dr = r'C:\Users\Артем\PycharmProjects\University\master_work\pictures\xndx_dr.png'
path_to_ndx_ma = r'C:\Users\Артем\PycharmProjects\University\master_work\pictures\ndx_ma.png'
path_to_ndx_dr = r'C:\Users\Артем\PycharmProjects\University\master_work\pictures\ndx_dr.png'
path_to_btc_ma = r'C:\Users\Артем\PycharmProjects\University\master_work\pictures\btc_ma.png'
path_to_btc_dr = r'C:\Users\Артем\PycharmProjects\University\master_work\pictures\btc_dr.png'
path_zero = r'C:\Users\Артем\PycharmProjects\University\master_work\pictures\zero.png'


xndx = 'Индекс NASDAQ BANK (XNDX) отслеживает производительность финансовых учреждений,' \
       'котирующихся на Nasdaq.\n Данные были загружены в формате ".csv" с сайта поставщика.\n' \
       'Поставщик данных: yahoo.finance;\n' \
       'Интервал сбора данных: 1 день;\n' \
       'Дата: 03-01-2000 - 02-05-2024;\n' \
       'Признаков до обработки: 7;\n' \
       'Признаков после обработки: 6;\n' \
       'Прецедентов до обработки: 6122;\n' \
       'Прецедентов после обработки: 6122;\n' \
       'Прогнозируемый признак: Close;\n' \
       'Максимум: 5408$;\n' \
       'Минимум: 1182$;\n' \
       'Средний показатель Close: 2810;'

xndx_mr = 'Аномалии для признака "Цена открытия (Open)":\n' \
           'Date, Open, High, Low, Close\n' \
           '2022-01-18, 1.0, 0.999481, 0.989543, 0.977901\n' \
          'Аномалии для признака "Цена закрытия (Close)":\n' \
          'Date, Open, High, Low, Close\n' \
          '2022-01-14, 0.977561, 0.999159, 0.985673, 1.0\n' \


ndx_mr ='Не построено для данного набора данных'



ndx = 'Индекс NASDAQ-100 включает 100 крупнейших нефинансовых компаний, котирующихся на NASDAQ.\n' \
      'Данные были загружены посредством API, используя библиотеку yfinance для Python.\n' \
      'Поставщик данных: yahoo.finance;\n' \
      'Интервал сбора данных: 1 день;\n' \
      'Дата: 01-10-1985 - 03-05-2024;\n' \
      'Признаков до обработки: 7;\n' \
      'Признаков после обработки: 6;\n' \
      'Прецедентов до обработки: 9725;\n' \
      'Прецедентов после обработки: 9725;\n' \
      'Прогнозируемый признак: Close;\n' \
      'Максимум: 18438$;\n' \
      'Минимум: 107$;\n' \
      'Средний показатель Close: 3274$;'


btc = 'BTC-USD отражает соотношение одной единицы криптовалюты Bitcoin к американскому доллару.\n' \
      'Данные были загружены посредством API, используя библиотеку yfinance для Python.\n' \
      'Поставщик данных: yahoo.finance;\n' \
      'Интервал сбора данных: 1 час;\n' \
      'Дата и время: 00:00:00 10-10-2022 - 23:00:00 04-05-2024;\n' \
      'Признаков до обработки: 7;\n' \
      'Признаков после обработки: 6;\n' \
      'Прецедентов до обработки: 13667;\n' \
      'Прецедентов после обработки: 13667;\n' \
      'Прогнозируемый признак: Close;\n' \
      'Максимум: 73749$;\n' \
      'Минимум: 15745$;\n' \
      'Средний показатель Close: 33434$;'


rns_1 = f'Результаты обучения и тестирования модели РНС-1'\
        f' с одним промежуточным слоем из 64 нейронов и 1 выходным слоем. Функция активации - "ReLU"\n' \
        f'Время обучения: 4.7 с\n' \
        f'Ошибка на 1 эпохе: 0.0858\n' \
        f'Потери при тестировании NASDAQ BANK: 0.00012\n' \
        f'Потери при тестировании NASDAQ 100: 4-e5\n' \
        f'Потери при тестировании BTC-USD: 3.464-e5\n' \
        f'Потери при тестировании NASDAQ 100 аугм.: 0.0006\n' \
        f'Потери при тестировании BTC-USD аугм.: 0.0003\n'

rns_2 = f'Результаты обучения и тестирования модели РНС-2' \
        f' с двумя промежуточными слоями, первый из 128 нейронов,' \
        f'второй из 64 нейронов и 1 выходным слоем. Функция активации - "ReLU"\n' \
        f'Время обучения: 8.93 с\n' \
        f'Ошибка на 1 эпохе: 0.0064\n' \
        f'Потери при тестировании NASDAQ BANK: 0.00011\n' \
        f'Потери при тестировании NASDAQ 100: 5.29-e5\n' \
        f'Потери при тестировании BTC-USD: 4.598-e5\n' \
        f'Потери при тестировании NASDAQ 100 аугм.: 0.0005\n' \
        f'Потери при тестировании BTC-USD аугм.: 0.0002\n'

rns_3 = f'Результаты обучения и тестирования модели РНС-3' \
        f' с двумя промежуточными слоями, первый из 128 нейронов,' \
        f'второй из 64 нейронов и 1 выходным слоем. Функция активации - "tanh"\n' \
        f'Время обучения: 10.12 с\n' \
        f'Ошибка на 1 эпохе: 0.0124\n' \
        f'Потери при тестировании NASDAQ BANK: 0.0033\n' \
        f'Потери при тестировании NASDAQ 100: 0.0057\n' \
        f'Потери при тестировании BTC-USD: 0.005\n' \
        f'Потери при тестировании NASDAQ 100 аугм.: 0.006\n' \
        f'Потери при тестировании BTC-USD аугм.: 0.0047\n'

rns_4 = f'Результаты обучения и тестирования модели РНС-4' \
        f' с двумя промежуточными слоями, первый из 128 нейронов,' \
        f'второй из 64 нейронов и 1 выходным слоем. Функция активации - "sigmoid"\n' \
        f'Время обучения: 8.4 с\n' \
        f'Ошибка на 1 эпохе: 0.0461\n' \
        f'Потери при тестировании NASDAQ BANK: 0.00043\n' \
        f'Потери при тестировании NASDAQ 100: не проводилось\n' \
        f'Потери при тестировании BTC-USD: не проводилось\n' \
        f'Потери при тестировании NASDAQ 100 аугм.: не проводилось\n' \
        f'Потери при тестировании BTC-USD аугм.: не проводилось\n'

rns_5 = f'Результаты обучения и тестирования модели РНС-5' \
        f' с двумя промежуточными слоями, первый из 128 нейронов, второй из 64 нейронов, и 1 выходного слоя.' \
        f' Функция активации - "LeakyReLU"\n' \
        f'Время обучения: 8.83 с\n' \
        f'Ошибка на 1 эпохе: 0.0098\n' \
        f'Потери при тестировании NASDAQ BANK: 0.00023\n' \
        f'Потери при тестировании NASDAQ 100: не проводилось\n' \
        f'Потери при тестировании BTC-USD: не проводилось\n' \
        f'Потери при тестировании NASDAQ 100 аугм.: не проводилось\n' \
        f'Потери при тестировании BTC-USD аугм.: не проводилось\n'


hnn_1 = f'Результаты обучения и тестирования модели ГНС-1'\
        f' с двумя промежуточными слоями:\n1 рекуррентный, 64 нейрона, функция - "relu";\n' \
        f'2  сеть с долгой краткосрочной памятью, 32 нейрона, функция - "relu";\n' \
        f'и 1 выходным слоем."\n' \
        f'Время обучения: 9.632 с\n' \
        f'Ошибка на 1 эпохе: 0.0066\n' \
        f'Потери при тестировании NASDAQ BANK: 0.0003\n' \
        f'Потери при тестировании NASDAQ 100: 3.48-e5\n' \
        f'Потери при тестировании BTC-USD: 3.266-e5\n' \
        f'Потери при тестировании NASDAQ 100 аугм.: 0.0004\n' \
        f'Потери при тестировании BTC-USD аугм.: 0.0002\n'

hnn_2 = f'Результаты обучения и тестирования модели ГНС-2' \
        f' с двумя промежуточными слоями:\n1 рекуррентный, 128 нейронов, функция "relu", DropOut(0.2);\n' \
        f'2 сеть с долгой краткосрочной памятью, 32 нейрона, функция "relu";\nи 1 выходным слоем."\n' \
        f'Время обучения: 12 с\n' \
        f'Ошибка на 1 эпохе: 0.0161\n' \
        f'Потери при тестировании NASDAQ BANK: 0.0012\n' \
        f'Потери при тестировании NASDAQ 100: 0.0012\n' \
        f'Потери при тестировании BTC-USD: 0.001\n' \
        f'Потери при тестировании NASDAQ 100 аугм.: 0.0017\n' \
        f'Потери при тестировании BTC-USD аугм.: 0.0011\n'

hnn_3 = f'Результаты обучения и тестирования модели ГНС-3' \
        f' с двумя промежуточными слоями:\n1 рекуррентный, 64 нейрона, функция "tanh", DropOut(0.2);\n' \
        f'2 сеть с долгой краткосрочной памятью, 32 нейрона, функция "tanh", DropOut(0.2);\n' \
        f'и 1 выходным слоем.\n' \
        f'Время обучения: 10.1 с\n' \
        f'Ошибка на 1 эпохе: 0.0173\n' \
        f'Потери при тестировании NASDAQ BANK: 0.0005\n' \
        f'Потери при тестировании NASDAQ 100: 8.64-e5\n' \
        f'Потери при тестировании BTC-USD: 7.449-e5\n' \
        f'Потери при тестировании NASDAQ 100 аугм.: 0.0005\n' \
        f'Потери при тестировании BTC-USD аугм.: 0.0003\n'

hnn_4 = f'Результаты обучения и тестирования модели ГНС-4' \
        f' с тремя промежуточными слоями:\n1 рекуррентный, 128 нейронов, функция "relu", DropOut(0.15);\n' \
        f'2 сеть с долгой краткосрочной памятью, 64 нейрона, функция "relu", DropOut(0.15);\n' \
        f'3 сеть с долгой краткосрочной памятью, 32 нейрона, функция "relu", DropOut(0.15);\n' \
        f'1 выходным слоем.;\n' \
        f'Время обучения: 17.2 с\n' \
        f'Ошибка на 1 эпохе: 0.0098\n' \
        f'Потери при тестировании NASDAQ BANK: 0.0005\n' \
        f'Потери при тестировании NASDAQ 100: не проводилось\n' \
        f'Потери при тестировании BTC-USD: не проводилось\n' \
        f'Потери при тестировании NASDAQ 100 аугм.: не проводилось\n' \
        f'Потери при тестировании BTC-USD аугм.: не проводилось\n'

hnn_5 = f'Результаты обучения и тестирования модели ГНС-5' \
        f' с тремя промежуточными слоями:\n1 рекуррентный, 64 нейрона, функция "tanh", DropOut(0.15);\n' \
        f'2 сеть с долгой краткосрочной памятью, функция "tanh", DropOut(0.2);\n' \
        f'3 сеть с долгой краткосрочной памятью, функция "tanh", DropOut(0.2);\n' \
        f'и 1 выходного слоя.\n' \
        f'Время обучения: 16.81 с\n' \
        f'Ошибка на 1 эпохе: 0.0218\n' \
        f'Потери при тестировании NASDAQ BANK: 0.0005\n' \
        f'Потери при тестировании NASDAQ 100: не проводилось\n' \
        f'Потери при тестировании BTC-USD: не проводилось\n' \
        f'Потери при тестировании NASDAQ 100 аугм.: не проводилось\n' \
        f'Потери при тестировании BTC-USD аугм.: не проводилось\n'

