#Нужно было рассчитать оптимальный размер заказа на предприятии методом золотого сечения, учитывая такие параметры, как D - интенсивность заказа, K - стоимость заказа, h - стоимость хранения единицы продукции, x - оптимальный размер заказа. Функция на основе этих параметров - K*D/ x + ((x*h)/2) . Интвервал неопределенности - [700, 800]
#Собственно, зачем решать вручную, если у нас есть Python. Реализация приведена ниже, результат сопоставим с аналитическим решением данной задачи.


from math import sqrt


def myfunc(x):
    return (180 / x) * 60 + (x / 2) * 0.04


def golden(f, a, b,  tolerance=1e-6):
    phi = (sqrt(5) - 1) / 2 # расчет константы золотого сечения
    c = a + (1 - phi) * (b - a)
    d = a + b - c
    while abs(b - a) > tolerance:
        if f(c) <= f(d):
            b = d
            d = c
            c = a + (1 - phi) * (b - a)
        else:
            a = c
            c = d
            d = a + b - c
    return [a, b], (a + b) / 2

a = 700
b = 800
tolerance = 3.5
print(golden(f=myfunc, a=a, b=b, tolerance=tolerance))
